'number' + 3 + 3 // В цьому випадку використовується принцип конкатенації при якій проходить об'єдання операндів. 
// Саме об'єдання, а не додавання. Так як один з операндів є рядком. 
// крок 1 це об'єдання операндів 'number' + 3 = number3
// крок 2 це об'єдання попереднього результату з наступний операндом number3 + 3 = number33

null + 3 // Значення null в цоьму випадку прийме "0" бо відбувається арифметична дія.
// Тому результат арифметичної операції  додавання буде "3" (0 + 3 = 3).
    
5 && "qwerty" // В данному прикладі задіяний оператор "&&" який повертає перше значення якщо false або останнє значення якщо всі = true.
// В нашому випадку два значення = true. Тому 5 && "qwerty" буде повернуто операнд "qwerty" бо він останній.

+'40' + +'2' + "hillel" //+ попереду (унарний) робить з рядків - числа. 
// крок 1 вираз набуває наступного знаяення 40 + 2 + "hillel"
// крок 2 42 + "hillel" - далі відбувається об'єднання (конкантенація) 
// крок 3 число 42 стає рядком. В результаті маємо "42hillel"

'10' - 5 === 6 // В цьому випадку в нас відпрацьовує правило, коли маємо декілька операндів один із них число то рядок теж стає числом.
// крок 1 Вираз набуває вигляд після перетворення 10 - 5 === 6
// крок 2 10 - 5 = 5
// крок 3 Відбувається порівняння зі строгою рівностю за рахунок оператора "===" 
// крок 4 (5 не дорівнює 6) і результатом цього порівняння буде = false.

true + false // По факту true = 1 а false = 0 якщо відбувається арифметична дія. Тому дія з додавання має виглядати як вираз 1 + 0 = 1

'4px' - 3 // По принципу перетворення за правилами JS якщо відбувається арефметична дія і одним із значень є число, то інші операнди
// теж набувають числового значення. Але в данному випадку '4px' не є повноцінним числом бо містить літери 
// тому перетворення опернада на число не відбувається.
// В цьому випадку операнд набуває значення NaN, не є числом. По правилам якщо відбувається арифметична дія з NaN то результатом буде NaN.

'4' - 3 // Тут операнд '4' автоматично набуває числового значення, так як є арифметична дія і один з операндів є число. 
// результатом такої арифметики виразу 4 - 3 буде = 1

'6' + 3 ** 0 // крок 1 спочатку відбувається "**"" піднесення до степеня 3**0 = 1 (Будь яке піднесення до степення 0 = 1)
// крок 2 зараз вже відбувається конкантенація у виразі '6' + 1, що в результаті = 61.

12 / '6' // Арифметична дія, при якій операнд '6' перетворюється на числове значення. Далі проходить фактичне ділення 12 / 6, що = 2

'10' + (5 === 6) // В цьому прикладі проводиться строге порівняння, де 
// крок 1 (5 === 6) = false
// крок 2 конкантенація '10' + false, в результаті маємо '10false'

null == '' // В цьому прикладі відбувається не строге порівняня. Відповідно до правила де null порівнюватись тільки undefined = true.
// в нашому випадку це не підпадає під правило, тому порівняння з пустим рядком буде приймати значення false.

3 ** (9 / 3) // Арифметичні дії, 
// де крок 1 відбувається ділення в душках ( 9 / 3) = 3.
// крок 2 3 в корені 3 = 27

!!'false' == !!'true' // !! перетворюють будь-яке значення на логічне (true/false). Тому в нашому випадку маємо не строге порівняння, 
// де порівнюється логічне true та true, так як будь яке не пусте значення це вже = true.
// !!'false' == !!'true' результат = true

0 || '0' && 1 // Тут застосовується оператор && та ||, де && має більший пріоритет. 
// крок 1 спочатку відбувається виконується вираз '0' && 1 = true. 
// крок 2 || повертає перший “true” операнд, або останній, якщо всі false. Тому тепер вираз набуває вигляду 0 || 1, де результат = 1

(+null == false) < 1 // крок 1 Унарний + перетворює операнд на число null = 0 .
// крок 2 false в нашому випадку набува 0 при не стргому порівнянні, тому порівняння відбувається між двома 0, а саме 0 == 0 = true
// крок 3 в числовому порівняні де ми маємо true < 1, true = 1. Маємо числове порівняння 1 < 1 = false

false && true || true // && має вищий пріоритет чим ||, 
// крок 1 робиться перша дія між false та true, де отримаємо false в результаті.
// крок 2 результатом дії оператора false || true = true, бо повертається перший операнд як true.

false && (false || true) // крок1 перша дія робиться в душках. Повертається перший операнд як true, маємо вираз в результаті 
// false || true = true.
// крок 2 наступна дія де false && true = false, бо правило вказує на те що спочатку перевіряється перший операнд і якщо він false
// то інше вже не первіряється, і повертається тільки значення false.

(+null == false) < 1 ** 5 // крок 1 унарний + перетворює значення на число тому маємо вираз з обчислення в душках 
// де відбувається не строге порівняння 0 == 0 = true
// крок 2 піднесення до степеня 1 ** 5 = 1
// крок 3 відбувається числове порівння між першим та другим результатом де true стає 1 і маємо вираз 1 < 1 що = false як фінальний результат.